# Pandas dataframe

Data frame is a main object in pandas. It is used to represent data with rows and columns

Data frame is a datastructure represent the data in tabular or excel spread sheet like data)

**creating dataframe:**

In [ ]:
import pandas as pd
#Reading file from GIT HUB
diab_git = pd.read_csv("Datasets/diabetes.csv")
diab_git.headad(5)

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1

[5 rows x 9 columns]

In [3]:
#list of tuples

weather_data = [('1/1/2017', 32, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, 2, 'snow'),
                ('1/4/2017', 24, 7, 'snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', 31, 2, 'Sunny')
               ]
df1 = pd.DataFrame(weather_data, columns=['date', 'temp', 'wspeed', 'event'])
df1

       date  temp  wspeed  event
0  1/1/2017    32       6   Rain
1  1/2/2017    35       7  Sunny
2  1/3/2017    28       2   snow
3  1/4/2017    24       7   snow
4  1/5/2017    32       4   Rain
5  1/6/2017    31       2  Sunny

In [ ]:
#dimentions of the table

df1.shape

(6, 4)

In [ ]:
df1.head()

       date  temp  wspeed  event
0  1/1/2017    32       6   Rain
1  1/2/2017    35       7  Sunny
2  1/3/2017    28       2   snow
3  1/4/2017    24       7   snow
4  1/5/2017    32       4   Rain

In [ ]:
df1.tail()

       date  temp  wspeed  event
1  1/2/2017    35       7  Sunny
2  1/3/2017    28       2   snow
3  1/4/2017    24       7   snow
4  1/5/2017    32       4   Rain
5  1/6/2017    31       2  Sunny

In [9]:
#slicing
df1[2:5]

       date  temp  wspeed event
2  1/3/2017    28       2  snow
3  1/4/2017    24       7  snow
4  1/5/2017    32       4  Rain

In [7]:
df1[['wspeed', 'date']]
#df1['wspeed']

   wspeed      date
0       6  1/1/2017
1       7  1/2/2017
2       2  1/3/2017
3       7  1/4/2017
4       4  1/5/2017
5       2  1/6/2017

In [ ]:
df1.day      #particular column data

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [9]:
df1.dtypes

day       object
temp       int64
wspeed     int64
event     object
dtype: object

In [10]:
#another way of accessing column
df1['day'] #df.day (both are same)

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [10]:
#get 2 or more columns
df[['day', 'event', 'temp']]

        day  event  temp
0  1/1/2017   Rain    32
1  1/2/2017  Sunny    35
2  1/3/2017   snow    28
3  1/4/2017   snow    24
4  1/5/2017   Rain    32
5  1/6/2017  Sunny    31

In [18]:
#print max temperature
df['temp'].max()

35

In [19]:
#print max temperature
df['temp'].min()

24

In [11]:
#print max temperature
df.describe()

            temp    wspeed
count   6.000000  6.000000
mean   30.333333  4.666667
std     3.829708  2.338090
min    24.000000  2.000000
25%    28.750000  2.500000
50%    31.500000  5.000000
75%    32.000000  6.750000
max    35.000000  7.000000

In [13]:
df.event.describe()

count        6
unique       3
top       snow
freq         2
Name: event, dtype: object

In [14]:
# select rows which has maximum temperature
df[df.temp == df.temp.max()]

        day  temp  wspeed  event
1  1/2/2017    35       7  Sunny

In [10]:
#select only day column which has maximum temperature
df.day[df.temp == df.temp.max()]

1    1/2/2017
Name: day, dtype: object